tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/python'
# tap 'fisherman/tap'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'binutils', args: ['with-default-names']
brew 'bfg'
brew 'boost'
brew 'cairo'
brew 'cctools'
brew 'cmake'
brew 'coreutils', args: ['with-default-names']
brew 'diffutils', args: ['with-default-names']
brew 'doxygen'
brew 'findutils', args: ['with-default-names'] # can cause Python builds to fail
brew 'ffmpeg', args: ['with-default-names']
brew 'fish'
# brew 'fisherman'
brew 'fontconfig'
brew 'freetype'
brew 'gcc', args: ['with-default-names', 'with-all-languages']
brew 'gdk-pixbuf'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-flow-avh'
brew 'glib'
brew 'gmp'
brew 'gnutls', args: ['with-default-names']
brew 'gnu-getopt', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gobject-introspection'
brew 'gpg'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'gzip'
brew 'harfbuzz'
brew 'highlight',
brew 'htop'
brew 'hub'
brew 'hubflow'
brew 'icu4c'
brew 'imagemagick', args: ['with-webp', 'with-librsvg']
brew 'isl'
brew 'jpeg'
brew 'keybase'
brew 'lame'
brew 'libcroco'
brew 'libevent'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libsvg'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'lua'
brew 'mackup'
brew 'markdown'
brew 'mas'
brew 'moreutils', args: ['with-default-names']
brew 'mpfr'
brew 'msgpack'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'numpy', args: ['with-python3', 'without-python']
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pixman'
brew 'pkg-config'
brew 'python', args: ['framework', 'with-brewed-openssl']
brew 'python3', args: ['framework', 'with-brewed-openssl']
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'readline'
brew 'ruby-build'
brew 'scipy', args: ['with-python3', 'without-python']
brew 'homebrew/dupes/screen'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'swig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unibilium'
brew 'vim', args: ['override-system-vi']
brew 'watch'
brew 'webp'
brew 'wget', args: ['enable-iri']
brew 'x264'
brew 'xvid'
brew 'xz'

cask_args appdir: '~/Applications'

cask 'font-alegreya'
cask 'font-alegreya-sans'
cask 'font-alegreya-sans-sc'
cask 'font-alegreya-sc'
cask 'font-anonymous-pro'
cask 'font-anonymice-powerline'
cask 'font-arvo'
cask 'font-cabin'
cask 'font-cabin-condensed'
cask 'font-cabin-sketch'
cask 'font-cinzel'
cask 'font-cinzel-decorative'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-droid-serif'
cask 'font-fanwood-text'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-karla'
cask 'font-lato'
cask 'font-liberation-mono-for-powerline'
cask 'font-libre-baskerville'
cask 'font-libre-caslon-text'
cask 'font-linden-hill'
cask 'font-lora'
cask 'font-menlo-for-powerline'
cask 'font-meslo-lg-for-powerline'
cask 'font-merriweather'
cask 'font-merriweather-sans'
cask 'font-monofur-for-powerline'
cask 'font-montserrat'
cask 'font-montserrat-alternates'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-orbitron'
cask 'font-oswald'
cask 'font-playfair-display'
cask 'font-playfair-display-sc'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-quicksand'
cask 'font-raleway'
cask 'font-raleway-dots'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-slab'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-telex'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-vollkorn'

cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'cheatsheet'
cask 'chrome-remote-desktop-host'
cask 'colorpicker'
cask 'dash'
cask 'diffmerge'
cask 'doxie'
cask 'doxygen'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flash-npapi'
cask 'flash-ppapi'
# cask 'fluid' # Checksum mismatch on download
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'gpgtools'
cask 'iterm2-beta'
cask 'java'
cask 'karabiner'
cask 'keybase'
cask 'kodi'
cask 'mactex'
cask 'macvim'
# meld
cask 'https://gist.githubusercontent.com/tobywf/f731a9aa9ebaec47bb098af9d90cb8b5/raw/1f6acffb47d89a1e9eb32fbb5acea7bd4a065575/meldmerge.rb'
cask 'mysqlworkbench'
cask 'postman'
cask 'quip'
cask 'rescuetime'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotifree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'textual'
cask 'tower'
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'

# mas '1Password', id: 443987910
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Giphy Capture', id: 668208984
# mas 'Paw', id: 584653203
# mas 'Sip', id: 507257563
# mas 'Sketch', id: 402476602
# mas 'Tweetbot', id: 557168941
# mas 'Wunderlist', id: 410628904

# Airmail
# Divvy
# Pixelmator
# The Archive Browser
