tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homewbrew/python'

brew 'awscli'
brew 'coreutils', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'ffmpeg', args: ['with-default-names']
brew 'fish'
brew 'git'
brew 'gitflow'
brew 'grep', args: ['with-default-names']
brew 'hub'
brew 'hubflow'
brew 'imagemagick', args: ['with-webp', 'with-librsvg']
brew 'keybase'
brew 'mackup'
brew 'markdown'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'numpy', args: ['with-python3', 'without-python']
brew 'openssl'
brew 'python', args: ['framework', 'with-brewed-openssl']
brew 'python3', args: ['framework', 'with-brewed-openssl']
brew 'rbenv'
brew 'scipy', args: ['with-python3', 'without-python']
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim', args: ['override-system-vi']
brew 'wget'

cask_args appdir: '~/Applications'

cask 'font-alegreya'
cask 'font-alegreya-sans'
cask 'font-alegreya-sans-sc'
cask 'font-alegreya-sc'
cask 'font-anonymous-pro'
cask 'font-anonymous-pro-for-powerline'
cask 'font-arvo'
cask 'font-cabin'
cask 'font-cabin-condensed'
cask 'font-cabin-sketch'
cask 'font-cinzel'
cask 'font-cinzel-decorative'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-droid-serif'
cask 'font-fanwood-text'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-karla'
cask 'font-lato'
cask 'font-libre-baskerville'
cask 'font-libre-caslon-text'
cask 'font-linden-hill'
cask 'font-lora'
cask 'font-merriweather'
cask 'font-merriweather-sans'
cask 'font-montserrat'
cask 'font-montserrat-alternates'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-orbitron'
cask 'font-oswald'
cask 'font-playfair-display'
cask 'font-playfair-display-sc'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-quicksand'
cask 'font-raleway'
#cask 'font-raleway-dots'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-slab'
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
#cask 'font-telex'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-powerline'
cask 'font-vollkorn'

cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'cheatsheet'
cask 'colorsnapper'
cask 'dash'
cask 'doxie'
cask 'doxygen'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flash-npapi'
cask 'flash-ppapi'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2-beta'
cask 'java'
cask 'karabiner'
cask 'keybase'
cask 'kodi'
# meld
cask 'https://gist.githubusercontent.com/tobywf/f731a9aa9ebaec47bb098af9d90cb8b5/raw/1f6acffb47d89a1e9eb32fbb5acea7bd4a065575/meldmerge.rb'
cask 'mysqlworkbench'
cask 'quip'
cask 'rescuetime'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotifree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'textual'
cask 'tower'
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'mactex'

mas '1Password', id: 443987910
mas 'Byword', id: 420212497
mas 'Deckset', id: 847496013
mas 'Giphy Capture', id: 668208984
mas 'Paw', id: 584653203
mas 'Sip', id: 507257563
mas 'Sketch', id: 402476602
mas 'Tweetbot', id: 557168941
mas 'Wunderlist', id: 410628904

# Airmail
# Divvy
# Pixelmator
# The Archive Browser
