tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/games'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/versions'

# No dependencies
brew 'ack'
brew 'autoconf'
brew 'awscli'
brew 'binutils'
brew 'bfg'
brew 'diffutils'
brew 'docbook'
brew 'ecj'
brew 'findutils'
brew 'gdbm'
brew 'gettext'
brew 'gmp'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gzip'
brew 'hardlink-osx'
brew 'htop'
brew 'icu4c'
brew 'intltool'
brew 'jpeg'
brew 'lame'
brew 'libffi'
brew 'libgpg-error'
brew 'libpng'
brew 'libtasn1'
brew 'libtool'
brew 'libusb'
brew 'lua'
brew 'mackup'
brew 'markdown'
brew 'mas'
brew 'oniguruma'
brew 'osxutils'
brew 'pcre'
brew 'pcre2'
brew 'pkg-config'
brew 'pth'
brew 'p7zip'
brew 'readline'
brew 'sphinx-doc'
brew 'ssh-copy-id'
brew 'tcl-tk', args: ['with-threads']
brew 'texi2html'
brew 'tree'
brew 'xvid'
brew 'xz'

# 1 level of dependencies
brew 'automake'
brew 'boost', args: ['with-icu4c']
brew 'cmake'
brew 'coreutils', args: ['with-gmp']
brew 'docbook-xsl'
brew 'fish'
brew 'freetype'
brew 'glib'
brew 'gnu-getopt'
brew 'grep'
brew 'isl'
brew 'jq'
brew 'libassuan'
brew 'libgcrypt'
brew 'libidn'
brew 'libksba'
brew 'libsvg'
brew 'libtermkey'
brew 'libtiff'
brew 'libusb-compat'
brew 'libvterm'
brew 'makedepend'
brew 'mpfr'
brew 'nettle'
brew 'pixman'
brew 'sqlite', args: ['with-docs', 'with-functions', 'with-icu4c', 'with-json1', 'with-session']
brew 'swig'
brew 'unibilium'
brew 'webp', args: ['with-libtiff']

# 2-levels of dependencies
brew 'dirmngr'
brew 'fontconfig'
brew 'git-flow-avh'
brew 'gnutls'
brew 'highlight',
brew 'libcroco'
brew 'libmpc'
brew 'libuv'
brew 'msgpack'
brew 'moreutils'
brew 'openssl'
brew 'pinentry'
brew 'screen'
brew 'shared-mime-info'

# 3-levels of dependencies
brew 'cairo'
brew 'gcc', args: ['with-all-languages']
brew 'git', args: ['with-blk-sha1', 'with-brewed-openssl', 'with-gettext', 'with-pcre']
brew 'gpg-agent'
brew 'neovim'
brew 'nmap'
brew 'node', args: ['with-debug', 'with-openssl']
brew 'python', args: ['with-sphinx-doc', 'with-tcl-tk']
brew 'python3', args: ['with-sphinx-doc', 'with-tcl-tk']
brew 'ruby-build'
brew 'wget', args: ['with-iri', 'with-pcre']

# 4-levels of dependencies
brew 'go'
brew 'gobject-introspection'
brew 'gpg2', args: ['with-readline']
brew 'hubflow'
brew 'libxml2', args: ['with-python']
brew 'llvm'
brew 'numpy', args: ['with-python3']
brew 'rbenv'
brew 'scipy', args: ['with-python3']
brew 'shellcheck'
brew 'vim', args: ['with-lua', 'with-override-system-vi', 'with-python3']
brew 'watch'
brew 'yasm', args: ['with-python']

# 5-levels of dependencies
brew 'cctools', args: ['with-llvm']
brew 'doxygen', args: ['with-llvm']
brew 'ffmpeg'
brew 'gdk-pixbuf'
brew 'harfbuzz', args: ['with-cairo']
brew 'hub'
brew 'keybase'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'x264'

# 6-levels of dependencies
brew 'libevent'
brew 'pango'

# 7-levels of dependencies
brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-pango', 'with-webp']
brew 'tmux'


cask_args appdir: '~/Applications'

cask 'font-alegreya'
cask 'font-alegreya-sans'
cask 'font-alegreya-sans-sc'
cask 'font-alegreya-sc'
cask 'font-anonymous-pro'
cask 'font-anonymice-powerline'
cask 'font-arvo'
cask 'font-cabin'
cask 'font-cabin-condensed'
cask 'font-cabin-sketch'
cask 'font-cinzel'
cask 'font-cinzel-decorative'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-droid-serif'
cask 'font-fanwood-text'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-karla'
cask 'font-lato'
cask 'font-liberation-mono-for-powerline'
cask 'font-libre-baskerville'
cask 'font-libre-caslon-text'
cask 'font-linden-hill'
cask 'font-lora'
cask 'font-menlo-for-powerline'
cask 'font-meslo-lg-for-powerline'
cask 'font-merriweather'
cask 'font-merriweather-sans'
cask 'font-monofur-for-powerline'
cask 'font-montserrat'
cask 'font-montserrat-alternates'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-orbitron'
cask 'font-oswald'
cask 'font-playfair-display'
cask 'font-playfair-display-sc'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-quicksand'
cask 'font-raleway'
cask 'font-raleway-dots'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-slab'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-telex'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-vollkorn'

cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'cheatsheet'
cask 'chrome-remote-desktop-host'
cask 'dash'
cask 'diffmerge'
cask 'doxygen'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flash-npapi'
cask 'flash-ppapi'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'gpgtools'
cask 'ibackupbot'
cask 'ifunbox'
cask 'iterm2-beta'
cask 'java'
cask 'karabiner'
cask 'keybase'
cask 'kodi'
# cask 'mactex'
cask 'macvim'
# meld
# cask 'https://gist.githubusercontent.com/tobywf/f731a9aa9ebaec47bb098af9d90cb8b5/raw/1f6acffb47d89a1e9eb32fbb5acea7bd4a065575/meldmerge.rb'
cask 'mysqlworkbench'
cask 'postman'
# cask 'quip'
cask 'rescuetime'
cask 'screens' # Use Special K app patcher
cask 'screens-connect'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotifree'
cask 'spotify'
cask 'steam'
# cask 'sublime-text'
# cask 'textual'
cask 'tower' # Use AppKed version
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'

# mas '1Password', id: 443987910
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Giphy Capture', id: 668208984
# mas 'Paw', id: 584653203
# mas 'Sip', id: 507257563
# mas 'Sketch', id: 402476602
# mas 'Tweetbot', id: 557168941
# mas 'Wunderlist', id: 410628904

# Airmail
# Divvy
# Pixelmator
# The Archive Browser
